# R을 이용한 통계분석 1주차 실습자료 (1)

# 기본기능 이해하기

# 명령어 실행과 주석(#) : [Ctrl]+[Enter]

x <- c(1:10)        # x에 1~10까지 숫자를 할당

x                   # x에 할당되어 있는 내용을 콘솔창에 출력

y <- c(1.2,0.7,3.4,5.1,9.2,6.7,7,8.2,12,10.7) # y에 다음 숫자를 할당

y                   # y에 할당되어 있는 내용을 콘솔창에 출력

plot(y,x)   # x와 y의 산포도(scatter plot)를 출력


rm(x)  # x를 제거
rm(y)  # y를 제거


# 실습하기 : 아래 주석을 참고하여 명령어를 직접 작성하고 결과를 확인해 보세요.
# Q1. "a" 객체에 5라는 값을 할당



# Q2. "b" 객체에 100이라는 값을 할당



# Q3. "a"와 "b"의 합을 "c" 객체에 할당




